# ——— 기본 모듈 파라미터 ———
N         = 2
S         = 2
m         = [4, 4, 4 ]
mean      = [5.0, 5.0]
d_init    = [5.0, 5.0]

cov1      = [[0.09 , 0.036], [0.036, 0.09]]
cov2      = [[0.09 , -0.036], [-0.036, 0.09]]
cov3      = [[0.09 , 0], [0.0, 0.09]]

# ——— W 계산용 샘플 개수 ———
total_w_samples = 5_000_000
batch_size      = 100_000

# ——— MPSS 샘플 개수 ———
err1      = 1e-3
err2      = 1e-3
err3      = 0.01
err4      = 0.07
err5      = 0.01
err6      = 0.5
err7      = 0.05
err8      = 1e-4
beta      = 0.3

# ——— 샘플링·CVaR 파라미터 ———
n_samples      = 512
n_test         = 10000
# beta           = 0.99
# alpha          = 0.1    # 논문에 0.1 사용
# m_cvar         = 200
# K              = 10